---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SplitToposolidFailures.SplitToposolidFailed
source: html/6bddcf32-f6af-dc25-bfb5-3922573ccb67.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SplitToposolidFailures.SplitToposolidFailed Property

Split toposolid failed.

## Syntax (C#)
```csharp
public static FailureDefinitionId SplitToposolidFailed { get; }
```